{
    "_comment": [
        "The tools listed here are defined at compile time and serve",
        "as the program’s default toolkit. ",
        "",
        "You may include additional CTF tools to extend the available options and",
        "customize the environment to your needs."
    ],
    "cyberchef": {
        "name": "CyberChef",
        "description": "\"The Cyber Swiss Army Knife\" - a web app for encryption, encoding, compression and data analysis. It allows for building complex data processing \"recipes\" to decode, deobfuscate, or transform data in CTF challenges."
    },
    "exiftool": {
        "name": "ExifTool",
        "description": "A command-line utility for reading, writing, and editing meta information in a wide variety of files. In CTFs, it's used to find hidden data, GPS coordinates, or other clues in file metadata."
    },
    "binwalk": {
        "name": "Binwalk",
        "description": "A tool for analyzing and extracting firmware images and binary files. It's essential in forensics and reversing challenges to find hidden files, file systems, or embedded code within a larger file."
    },
    "zsteg": {
        "name": "zsteg",
        "description": "A steganography tool that detects hidden data in PNG and BMP images. It can find data hidden in least-significant bits (LSB) and other techniques."
    },
    "stegseek": {
        "name": "StegSeek",
        "description": "A very fast steganography tool for seeking hidden data inside files. It's particularly effective for brute-forcing steghide passwords on JPG files, making it a go-to for certain steganography challenges."
    },
    "hashcat": {
        "name": "hashcat",
        "description": "A powerful and fast password recovery tool. In CTFs, it's used to crack password hashes obtained from various sources like password files, databases, or network captures."
    },
    "john": {
        "name": "John the Ripper",
        "description": "A popular password cracking tool. It can automatically detect the hash type and use various methods like dictionary attacks, brute-force, and rainbow tables to crack them. Often used as an alternative or in conjunction with hashcat."
    }
}
